{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "c887fde0-044f-43e4-acf0-853dad371f8a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3\n"
     ]
    }
   ],
   "source": [
    "import os, time\n",
    "NEO4J_PASSWORD = os.getenv(\"NEO4J_PASSWORD\", \"neo4j123\")\n",
    "from neo4j import GraphDatabase\n",
    "driver = GraphDatabase.driver(\"bolt://neo4j:7687\", auth=(\"neo4j\", NEO4J_PASSWORD))\n",
    "with driver.session() as s:\n",
    "    s.run(\"CREATE (:City {name:$name})\", name=\"La Plata\")\n",
    "    print(s.run(\"MATCH (n:City) RETURN count(n) AS c\").single()[\"c\"])\n",
    "driver.close()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "794e3f7d-4178-4b1e-96a3-eae9c510df2d",
   "metadata": {},
   "outputs": [],
   "source": [
    "MONGO_USER = os.getenv(\"MONGO_INITDB_ROOT_USERNAME\", \"admin\")\n",
    "MONGO_PASS = os.getenv(\"MONGO_INITDB_ROOT_PASSWORD\", \"admin123\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "1ccb271e-d553-4042-8093-1719d5fc7f83",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "InsertOneResult(ObjectId('68efee3f22193c431bc3f110'), acknowledged=True)"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from pymongo import MongoClient\n",
    "client = MongoClient(f\"mongodb://{MONGO_USER}:{MONGO_PASS}@mongo:27017/\")\n",
    "db = client[\"clase\"]\n",
    "\n",
    "db.alumnos.insert_one({\"nombre\":\"Edu\",\"tema\":\"Grafos\"})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "66e8ff6a-8e4b-481d-ae65-1943172073c9",
   "metadata": {},
   "outputs": [],
   "source": [
    "alumnos = db.alumnos.find()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "0aa41a87-63ce-498a-ac9a-7e1577fbc0c3",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'_id': ObjectId('68efee1c22193c431bc3f10e'), 'nombre': 'Edu', 'tema': 'Grafos'}\n",
      "{'_id': ObjectId('68efee3f22193c431bc3f110'), 'nombre': 'Edu', 'tema': 'Grafos'}\n"
     ]
    }
   ],
   "source": [
    "for alumno in alumnos: \n",
    "    print(alumno) "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "5f2e2bde-a185-4c8c-94d6-0ccec27a0c45",
   "metadata": {},
   "outputs": [],
   "source": [
    "db.alumnos.drop()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "ba2891ac-b2d6-4267-b877-1659caacad80",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.14"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
